const monthsReg = [
    /Январ([(ь|я|е|ю|ем|ём)]{0,2})/,
    /Феврал([(ь|я|е|ю|ем|ём)]{0,2})/,
    /Март([(а|е|у|ом)]{0,2})/,
    /Апрел([(ь|я|е|ю|ем|е)]{0,2})/,
    /Ма([(е|й|я|ю|ем)]{1,2})/,
    /Июн([(ь|я|е|ю|ем|е)]{0,2})/,
    /Июл([(ь|я|е|ю|ем|е)]{0,2})/,
    /Август([(а|е|у|ом)]{0,2})/,
    /Сентябр([(ь|я|е|ю|ем|ём)]{0,2})/,
    /Октябр([(ь|я|е|ю|ем|ём)]{0,2})/,
    /Ноябр([(ь|я|е|ю|ем|ём)]{0,2})/,
    /Декабр([(ь|я|е|ю|ем|ём)]{0,2})/,
];

/**
 * Get index of month name
 * @param {string} month
 * return {number}
 */
export function getMonthNumber(month) {
    for (const i in monthsReg) {
        const reg = monthsReg[i];
        if (month.match(reg)) {
            return Number(i);
        }
    }
}

